{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd\n",
    "from neo4j import GraphDatabase\n",
    "NEO4J_URI=\"neo4j+s://f6724121.databases.neo4j.io\"\n",
    "NEO4J_USERNAME=\"neo4j\"\n",
    "NEO4J_PASSWORD=\"hsPy2R3_HNAtQu_lJHWpdiAgLdi2OpeBv1D6d8uJGZk\"\n",
    "\n",
    "driver = GraphDatabase.driver(NEO4J_URI, auth=(NEO4J_USERNAME, NEO4J_PASSWORD), database=\"neo4j\")\n",
    "\n",
    "PROJECT = pd.read_csv('Projects.csv')\n",
    "INVESTOR = pd.read_csv('Investors.csv')\n",
    "TECH = pd.read_csv('Tech.csv')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ProjectID</th>\n",
       "      <th>Project_name</th>\n",
       "      <th>Geojson</th>\n",
       "      <th>Capacity_MW</th>\n",
       "      <th>Status</th>\n",
       "      <th>TechID</th>\n",
       "      <th>InvestorID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>PRJ001</td>\n",
       "      <td>Thang Long Wind</td>\n",
       "      <td>{\"type\":\"Feature\",\"properties\":{\"Project_Name\"...</td>\n",
       "      <td>3,400</td>\n",
       "      <td>Pre-Feseability Study</td>\n",
       "      <td>TECH01</td>\n",
       "      <td>INV001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  ProjectID     Project_name  \\\n",
       "0    PRJ001  Thang Long Wind   \n",
       "\n",
       "                                             Geojson Capacity_MW  \\\n",
       "0  {\"type\":\"Feature\",\"properties\":{\"Project_Name\"...       3,400   \n",
       "\n",
       "                  Status  TechID InvestorID  \n",
       "0  Pre-Feseability Study  TECH01     INV001  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "PROJECT['Geojson'] = PROJECT['Geojson'].apply(lambda x: x.replace(\"'\", '\"'))\n",
    "PROJECT.head(1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "EagerResult(records=[<Record COUNT(n)=0>], summary=<neo4j._work.summary.ResultSummary object at 0x12fb5ced0>, keys=['COUNT(n)'])"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Delete old data\n",
    "_delete_q = \"MATCH (w:Province) DETACH DELETE w\"\n",
    "# driver.execute_query(query_=_delete_q, database='neo4j')\n",
    "driver.execute_query(query_='MATCH (n:Province) RETURN COUNT(n)', database='neo4j')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Thang Long Wind', id: 'PRJ001', status: 'Pre-Feseability Study', capacity: '3,400', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"ThangLong Wind\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[108.322935342818,10.4566316736698]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ke Ga A Wind Farm', id: 'PRJ002', status: 'Concept/Early Planning', capacity: '900', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ke Ga A Wind Farm\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[108.168570974686,10.7206453171577]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'La Gan Wind Farm', id: 'PRJ003', status: 'Concept/Early Planning', capacity: '3,500', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"La Gan Wind Farm\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[108.714105339784,10.8770939179254]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ke Ga B Wind Farm', id: 'PRJ004', status: 'Concept/Early Planning', capacity: '4,950', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ke Ga B Wind Farm\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[108.207480512699,10.8222899523897]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Khai Long (intertidal)', id: 'PRJ005', status: 'Concept/Early Planning', capacity: '300', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Khai Long (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[104.788657,8.515702]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ngoc Hien', id: 'PRJ006', status: 'Development Zone', capacity: '3,000', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ngoc Hien\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[104.869139,8.538885]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan An 1 - 30 MW phase 2021-2025 (intertidal)', id: 'PRJ007', status: 'Under Construction', capacity: '30', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan An 1 - 30 MW phase 2021-2025 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.148268271298,8.64129304753884]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan An 1 - phase 1 (intertidal)', id: 'PRJ008', status: 'Fully Commissioned', capacity: '25', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan An 1 - phase 1 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.157673822139,8.6590184344324]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan An 1 - 45 MW phase 2021-2025 (intertidal)', id: 'PRJ009', status: 'Fully Commissioned', capacity: '45', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan An 1 - 45 MW phase 2021-2025 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.172957842255,8.66453928609911]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ca Mau (intertidal) phase 1', id: 'PRJ010', status: 'Fully Commissioned', capacity: '190', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ca Mau (intertidal) phase 1\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.372237950693,8.87572314489605]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan Thuan (intertidal) - phase two', id: 'PRJ011', status: 'Fully Commissioned', capacity: '50', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan Thuan (intertidal) - phase two\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.421249688277,8.97488260038911]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Dong Hai I', id: 'PRJ012', status: 'Fully Commissioned', capacity: '100', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Dong Hai I\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.500016,9.063952]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Hoa Binh 2 (intertidal)', id: 'PRJ013', status: 'Fully Commissioned', capacity: '50', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Hoa Binh 2 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.610683360679,9.0962180253499]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Bac Lieu - phase III (intertidal)', id: 'PRJ014', status: 'Under Construction', capacity: '142', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Bac Lieu - phase III (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.804024,9.183878]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Phu Cuong 1', id: 'PRJ015', status: 'Consent Authorised', capacity: '400', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Phu Cuong 1\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[105.973311434109,9.16151316329655]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Phu Cuong 2+', id: 'PRJ016', status: 'Concept/Early Planning', capacity: '1,000', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Phu Cuong 2+\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.244314,9.343636]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Soc Trang 7 - phase 1 (intertidal)', id: 'PRJ017', status: 'Fully Commissioned', capacity: '30', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Soc Trang 7 - phase 1 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.173749541735,9.33906957372287]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'V1-7 - Dong Hai 1 - Trung Nam (intertidal)', id: 'PRJ018', status: 'Fully Commissioned', capacity: '100', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"V1-7 - Dong Hai 1 - Trung Nam (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.414375,9.522595]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'V1-1 - Truong Long Hoa (intertidal)', id: 'PRJ019', status: 'Fully Commissioned', capacity: '48', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"V1-1 - Truong Long Hoa (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.579926041386,9.67899370205741]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ben Tre 2 (intertidal) - Nexif 2 + 3', id: 'PRJ020', status: 'Concept/Early Planning', capacity: '50', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ben Tre 2 (intertidal) - Nexif 2 + 3\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.726257554027,9.81117203329039]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Ben Tre 7 (intertidal)', id: 'PRJ021', status: 'Concept/Early Planning', capacity: '81', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Ben Tre 7 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.686605,9.970817]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan Phu Dong 1 (intertidal)', id: 'PRJ022', status: 'Fully Commissioned', capacity: '100', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan Phu Dong 1 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.897735355733,10.2027739184265]}}' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Enterprize Energy Group', id: 'INV001' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Cuong Thinh Group', id: 'INV002' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Copenhagen Infrastructure Partners,AsiaPetro,Novasia Energy Company Ltd', id: 'INV003' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Bamboo Capital Group (previously CP Super Wind Energy Công Lý 1)', id: 'INV005' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Gia Lai Electricity Joint Stock Company (GEC)', id: 'INV008' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Song Lam Investment Hydropower JSC (CTCP Đầu Tư Thủy Điện Sông Lam)', id: 'INV009' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'WTO: Trading Construction Works Organization', id: 'INV010' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Bắc Phương Energy Joint Stock Company', id: 'INV012' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Phuong Anh Group', id: 'INV013' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Cong Ly Construction-Trading-Tourism Co., Ltd. (Công Ty TNHH XD - TM -DL Công Lý),Super Wind Energy Company Limited,Super Wind Energy Công Lý Bạc Liêu', id: 'INV014' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Phu Cuong Group,Mainstream Renewable Power', id: 'INV015' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Soc Trang Energy Joint Stock Company', id: 'INV017' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Trungnam Group (Công ty Cổ phần Đầu tư Xây dựng Trung Nam)', id: 'INV018' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Climate Investor One,Samtan Co., Ltd (ST International)', id: 'INV019' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Nexif Energy,Ratch', id: 'INV020' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Ben Tre Renewable Energy - BTRE (Công ty cổ phần năng lượng tái tạo Bến Tre)', id: 'INV021' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'PECC2 - Power Engineering Consulting Joint Stock Company 2,Ca Mau Investment Renewable Power Joint Stock Company (CMC),Phan Vu Group', id: 'INV022' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Corio Generation Limited,FECON Power JSC', id: 'INV023' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'HBRE - H & Brothers Renewable Energy', id: 'INV024' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Corio Generation Limited', id: 'INV026' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'T&T Group JSC; Orsted A/S', id: 'INV027' })\n",
      "    \n",
      "\n",
      "    MERGE (:Investor {name: 'Orsted', id: 'INV030' })\n",
      "    \n",
      "\n",
      "    MERGE (:WindOffshoreProject {name: 'Tan Phu Dong 1 (intertidal)', id: 'PRJ022', status: 'Fully Commissioned', capacity: '100', geojson: '{\"type\":\"Feature\",\"properties\":{\"Project_Name\":\"Tan Phu Dong 1 (intertidal)\",\"Technology\":\"Wind Power\",\"Type\":\"Offshore},\"geometry\":{\"type\":\"Point\",\"coordinates\":[106.897735355733,10.2027739184265]}}' })\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "for i in range(len(INVESTOR)):\n",
    "    _prj_q = \"\"\"\n",
    "    MERGE (:WindOffshoreProject {{name: '{}', id: '{}', status: '{}', capacity: '{}', geojson: '{}' }})\n",
    "    \"\"\".format(\n",
    "        PROJECT['Project_name'][i],\n",
    "        PROJECT['ProjectID'][i],\n",
    "        PROJECT['Status'][i],\n",
    "        PROJECT['Capacity_MW'][i],\n",
    "        PROJECT['Geojson'][i],\n",
    "    )\n",
    "    driver.execute_query(query_=_prj_q, database='neo4j')\n",
    "    print(_prj_q)\n",
    "\n",
    "for i in range(len(INVESTOR)):\n",
    "    _inv_q = \"\"\"\n",
    "    MERGE (:Investor {{name: '{}', id: '{}' }})\n",
    "    \"\"\".format(\n",
    "        INVESTOR['Investor'][i],\n",
    "        INVESTOR['InvestorID'][i],\n",
    "    )\n",
    "    driver.execute_query(query_=_inv_q, database='neo4j')\n",
    "    print(_inv_q)\n",
    "\n",
    "for i in range(len(TECH)):\n",
    "    _tech_q = \"\"\"\n",
    "    MERGE (:Technology {{name: '{}', id: '{}', type: '{}' }})\n",
    "    \"\"\".format(\n",
    "        TECH['Technology'][i],\n",
    "        TECH['TechID'][i],\n",
    "        TECH['Type'][i],\n",
    "    )\n",
    "    driver.execute_query(query_=_tech_q, database='neo4j')\n",
    "    print(_prj_q)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>ProjectID</th>\n",
       "      <th>Project_name</th>\n",
       "      <th>Geojson</th>\n",
       "      <th>Capacity_MW</th>\n",
       "      <th>Status</th>\n",
       "      <th>TechID</th>\n",
       "      <th>InvestorID</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>PRJ001</td>\n",
       "      <td>Thang Long Wind</td>\n",
       "      <td>{\"type\":\"Feature\",\"properties\":{\"Project_Name\"...</td>\n",
       "      <td>3,400</td>\n",
       "      <td>Pre-Feseability Study</td>\n",
       "      <td>TECH01</td>\n",
       "      <td>INV001</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  ProjectID     Project_name  \\\n",
       "0    PRJ001  Thang Long Wind   \n",
       "\n",
       "                                             Geojson Capacity_MW  \\\n",
       "0  {\"type\":\"Feature\",\"properties\":{\"Project_Name\"...       3,400   \n",
       "\n",
       "                  Status  TechID InvestorID  \n",
       "0  Pre-Feseability Study  TECH01     INV001  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "PROJECT.head(1)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ001'}), (o:Investor {id: 'INV001'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ002'}), (o:Investor {id: 'INV002'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ003'}), (o:Investor {id: 'INV003'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ004'}), (o:Investor {id: 'INV002'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ005'}), (o:Investor {id: 'INV005'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ006'}), (o:Investor {id: 'INV003'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ007'}), (o:Investor {id: 'INV009'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ008'}), (o:Investor {id: 'INV008'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ009'}), (o:Investor {id: 'INV009'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ010'}), (o:Investor {id: 'INV010'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ011'}), (o:Investor {id: 'INV022'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ012'}), (o:Investor {id: 'INV012'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ013'}), (o:Investor {id: 'INV013'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ014'}), (o:Investor {id: 'INV014'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ015'}), (o:Investor {id: 'INV015'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ016'}), (o:Investor {id: 'INV015'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ017'}), (o:Investor {id: 'INV017'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ018'}), (o:Investor {id: 'INV018'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ019'}), (o:Investor {id: 'INV019'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ020'}), (o:Investor {id: 'INV020'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ021'}), (o:Investor {id: 'INV021'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ022'}), (o:Investor {id: 'INV022'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ023'}), (o:Investor {id: 'INV023'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ024'}), (o:Investor {id: 'INV024'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ025'}), (o:Investor {id: 'INV001'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ026'}), (o:Investor {id: 'INV026'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ027'}), (o:Investor {id: 'INV027'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ028'}), (o:Investor {id: 'INV022'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ029'}), (o:Investor {id: 'INV019'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ030'}), (o:Investor {id: 'INV030'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ031'}), (o:Investor {id: 'INV001'})\n",
      "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
      "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ001'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ002'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ003'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ004'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ005'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ006'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ007'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ008'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ009'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ010'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ011'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ012'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ013'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ014'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ015'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ016'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ017'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ018'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ019'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ020'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ021'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ022'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ023'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ024'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ025'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ026'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ027'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ028'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ029'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ030'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n",
      "\n",
      "    MATCH (s:WindOffshoreProject {id: 'PRJ031'}), (o:Technology {id: 'TECH01'})\n",
      "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
      "    CREATE (o)-[:CÓ]->(s)\n",
      "    \n"
     ]
    }
   ],
   "source": [
    "for i in range(len(PROJECT)):\n",
    "    r1_query = \"\"\"\n",
    "    MATCH (s:WindOffshoreProject {{id: '{}'}}), (o:Investor {{id: '{}'}})\n",
    "    CREATE (s)-[:THUỘC_VỀ]->(o)\n",
    "    CREATE (o)-[:ĐẦU_TƯ]->(s)\n",
    "    \"\"\".format(\n",
    "    PROJECT['ProjectID'][i],\n",
    "    PROJECT['InvestorID'][i],\n",
    "    )\n",
    "    print(r1_query)\n",
    "    driver.execute_query(query_=r1_query, database='neo4j')\n",
    "    \n",
    "for i in range(len(PROJECT)):\n",
    "    r2_query = \"\"\"\n",
    "    MATCH (s:WindOffshoreProject {{id: '{}'}}), (o:Technology {{id: '{}'}})\n",
    "    CREATE (s)-[:THUỘC_NHÓM]->(o)\n",
    "    CREATE (o)-[:CÓ]->(s)\n",
    "    \"\"\".format(\n",
    "    PROJECT['ProjectID'][i],\n",
    "    PROJECT['TechID'][i],\n",
    "    )\n",
    "    print(r2_query)\n",
    "    driver.execute_query(query_=r2_query, database='neo4j')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "base",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
